; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-2-2-237)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p4-2 - location
	p3-4 - location
	p2-0 - location
	p1-2 - location
	p0-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s3)
	(at driver4 s2)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s3)
	(at package2 s1)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 4)
	(= (time-to-walk p4-2 s4) 4)
	(= (time-to-walk s2 p4-2) 14)
	(= (time-to-walk p4-2 s2) 14)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 53)
	(= (time-to-walk p3-4 s3) 53)
	(= (time-to-walk s4 p3-4) 50)
	(= (time-to-walk p3-4 s4) 50)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 15)
	(= (time-to-walk p2-0 s2) 15)
	(= (time-to-walk s0 p2-0) 40)
	(= (time-to-walk p2-0 s0) 40)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 12)
	(= (time-to-walk p1-2 s1) 12)
	(= (time-to-walk s2 p1-2) 52)
	(= (time-to-walk p1-2 s2) 52)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 37)
	(= (time-to-walk p0-1 s0) 37)
	(= (time-to-walk s1 p0-1) 31)
	(= (time-to-walk p0-1 s1) 31)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 29)
	(= (time-to-drive s2 s0) 29)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 41)
	(= (time-to-drive s3 s0) 41)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 4)
	(= (time-to-drive s0 s4) 4)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 13)
	(= (time-to-drive s2 s4) 13)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 40)
	(= (time-to-drive s1 s3) 40)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 30)
	(= (time-to-drive s4 s3) 30)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 49)
	(= (time-to-drive s1 s2) 49)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 42)
	(= (time-to-drive s3 s2) 42)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 28)
	(= (time-to-drive s4 s1) 28)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s1)
	(at driver4 s3)
	(at truck1 s4)
	(at truck2 s1)
	(at package1 s4)
	(at package2 s2)
	))

(:metric minimize (+ (* 4 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 0 of 7
2. (walk driver1 s2 p1-2)
   deleted: (at driver1 s2)
   added: (at driver1 p1-2)
   goals met: 0 of 7
3. (walk driver1 p1-2 s1)
   deleted: (at driver1 p1-2)
   added: (at driver1 s1)
   goals met: 1 of 7
4. (walk driver2 s2 p2-0)
   deleted: (at driver2 s2)
   added: (at driver2 p2-0)
   goals met: 1 of 7
5. (walk driver2 p2-0 s0)
   deleted: (at driver2 p2-0)
   added: (at driver2 s0)
   goals met: 1 of 7
6. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 1 of 7
7. (load-truck package1 truck1 s3)
   deleted: (at package1 s3)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 7
8. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 0 to 410
   goals met: 1 of 7
9. (drive-truck truck2 s3 s1 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (fuel-used) from 410 to 810
   goals met: 2 of 7
10. (drive-truck truck1 s3 s2 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 810 to 1272
   goals met: 2 of 7
11. (load-truck package2 truck2 s1)
   deleted: (at package2 s1)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 7
12. (drive-truck truck2 s1 s2 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 1272 to 1811
   goals met: 1 of 7
13. (unload-truck package2 truck2 s2)
   deleted: (in package2 truck2)
   added: (at package2 s2)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 2 of 7
14. (drive-truck truck2 s2 s1 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 1811 to 2301
   goals met: 3 of 7
15. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 4 of 7
16. (drive-truck truck1 s2 s4 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 2301 to 2444
   goals met: 5 of 7
17. (unload-truck package1 truck1 s4)
   deleted: (in package1 truck1)
   added: (at package1 s4)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 6 of 7
18. (drive-truck truck1 s4 s3 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   changed: (fuel-used) from 2444 to 2744
   goals met: 5 of 7
19. (disembark-truck driver3 truck1 s3)
   deleted: (driving driver3 truck1)
   added: (at driver3 s3) (empty truck1)
   goals met: 5 of 7
20. (walk driver4 s2 p4-2)
   deleted: (at driver4 s2)
   added: (at driver4 p4-2)
   goals met: 5 of 7
21. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 5 of 7
22. (walk driver4 p4-2 s4)
   deleted: (at driver4 p4-2)
   added: (at driver4 s4)
   goals met: 5 of 7
23. (drive-truck truck1 s3 s4 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (fuel-used) from 2744 to 3044
   goals met: 6 of 7
24. (walk driver4 s4 p3-4)
   deleted: (at driver4 s4)
   added: (at driver4 p3-4)
   goals met: 6 of 7
25. (walk driver4 p3-4 s3)
   deleted: (at driver4 p3-4)
   added: (at driver4 s3)
   goals met: 7 of 7
